<?php

$lang['required']			= "Это %s необходимое поле.";
$lang['isset']				= "Это %s поле должно иметь значение.";
$lang['valid_email']		= "Это %s поле должно содержать адрес email.";
$lang['valid_emails']		= "Это %s поле должно содержать действительный адрес email.";
$lang['valid_url']			= "Это %s поле должно содержать действительный URL-адрес.";
$lang['valid_ip']			= "Это %s поле должно содержать действительный IP-адрес.";
$lang['min_length']			= "Это %s поле должно содержать не менее %s количество символов.";
$lang['max_length']			= "Это %s поле не может превышать %s символов.";
$lang['exact_length']		= "Это %s поле должно строго содержать %s символов.";
$lang['alpha']				= "Это %s поле может содержать только алфавитные символы.";
$lang['alpha_numeric']		= "Это %s поле может содержать только алфавитно-цифровые символы.";
$lang['alpha_dash']			= "Это %s поле может содержать только алфавитно-цифровые символы, подчеркивания, и тире.";
$lang['numeric']			= "Это %s поле может содержать только цифры.";
$lang['is_numeric']			= "Это %s поле может содержать только числовые символы.";
$lang['integer']			= "Это %s поле должно содержать целое число.";
$lang['regex_match']		= "Это %s поле не в правильном формате.";
$lang['matches']			= "Это %s поле не совпадает с этим %s полем.";
$lang['is_unique'] 			= "Это %s поле должно содержать уникальное значение.";
$lang['is_natural']			= "Это %s поле должно содержать только положительные числа.";
$lang['is_natural_no_zero']	= "Это %s поле должно содержать число больше чем ноль.";
$lang['decimal']			= "Это %s поле должно содержать десятичное число.";
$lang['less_than']			= "Это %s поле должно содержать число меньше чем %s.";
$lang['greater_than']		= "Это %s поле должно содержать число больше чем %s.";


/* End of file form_validation_lang.php */
/* Location: ./system/language/english/form_validation_lang.php */